{"pages":[{"title":"Pilvi Platform Documentation","text":"Welcome to Pilvi Platform Documentation! This documentation describes Pilvi's key functionality and features. DRAFT","tags":"","url":"index.html"},{"title":"Overview","text":"Pilvi™ provides a sales automation and management tool. We empower you with the ability to create effective trial, order and billing processes, as well as manage customer accounts, and expand and improve your business by tracking SaaS metrics. Pilvi is your platform for growth. Platform The user interface of the Pilvi Platform is separated into three sections: Shop, Console, Manager. Shop Console Manager Use cases","tags":"","url":"Overview.html"},{"title":"Getting Started","text":"","tags":"","url":"Using_Pilvi_Cloud_Shop\/Getting_Started.html"},{"title":"Account Settings","text":"Recurring payments Addresses","tags":"","url":"Using_Pilvi_Cloud_Shop\/Account_Settings.html"},{"title":"Invoices","text":"","tags":"","url":"Using_Pilvi_Cloud_Shop\/Invoices.html"},{"title":"Services","text":"","tags":"","url":"Using_Pilvi_Cloud_Shop\/Services.html"},{"title":"Getting Started","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Getting_Started.html"},{"title":"Action Rules","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Action_Rules.html"},{"title":"Analytics","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Analytics.html"},{"title":"Branding & Themes","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Branding_&_Themes.html"},{"title":"Catalog","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Catalog.html"},{"title":"Content Management","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Content_Management.html"},{"title":"Customers","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Customers.html"},{"title":"Integrations","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Integrations.html"},{"title":"Messaging","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Messaging.html"},{"title":"Payments","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Payments.html"},{"title":"Preferences","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Preferences.html"},{"title":"Reports","text":"","tags":"","url":"Managing_Pilvi_Cloud_Shop\/Reports.html"},{"title":"Service Integrations","text":"Service Integrations Service integrations allow external SaaS services to integrate into Pilvi as a Service provisioning target. Pilvi Automatic Integration Technology API (PAITA) PAITA aka The Pilvi Automatic Integration Technology API is an API interface designed for partners to easily sell and manage their SaaS products. For example it provides automatic provisioning, interface usage statistics, vast management options for products and services. PAITA can be also used to provide a third-party SaaS services and products for partners own Pilvi shop. PAITA is composed from two parts: Service Integration API Specification and Service Management API The Service Integration API Specification provides an interface for the partner to develop in order for Pilvi to automatically integrate into the partner’s cloud service. The Service Management API provides an interface for the partner to call in order to notify Pilvi of changes to Services. Service Management API is a supplementary API meant to be used with a Service Integration API Implementation. You can find more information and specific instructions for these API parts from links below: Service Integration API Specification Service Management API","tags":"","url":"Integrations\/Service_Integrations.html"},{"title":"Site Integrations","text":"Site Integrations Site integrations allow external services to integrate into Pilvi in a way that extends the functionalities of the Site. Zapier Zapier integration allows any user from zapier.com receive data (by trigger each 15 minutes) about Pilvi new Services, Products and (Customer) Profiles. For authentication, the user at zapier.com selects the Pilvi app when creating Zapier Zap at zapier.com and provides Pilvi's values for: Site identifier API key API domain The values for those fields can be generated and copied at each Pilvi Site: Manager -&gt; System -&gt; Zapier Integration Currently supported Zapier Triggers for getting Pilvi data are: New Service New Product New Customer Profile","tags":"","url":"Integrations\/Site_Integrations.html"},{"title":"Changelog","text":"Pilvi Platform Changelog (2018-05-24) Changes T281 Added Zapier integration. Triggers for new Services, Product, Customer Profiles T343 Added support for Customer defined Pages T126 Added Product clone functionality T327 Changed edit button logic and texts. Add button is now shown only in View mode. In Edit mode, the text on the Edit button is changed to 'Cancel' T287 Platform default message templates are now stored separately from other templates T357 Trailing slashes are ignored by default Fixes T355 Fixed a bug where the WYSIWYG editor failed to initialize after multiple sequential uses","tags":"","url":"Changelog.html"}]}