{"pages":[{"title":"Pilvi Platform Documentation","text":"Welcome to Pilvi™ Platform Documentation! This documentation describes the key functionalities and features of Pilvi™ Platform.","tags":"","url":"index.html"},{"title":"Overview","text":"Table of Contents Pilvi™ Platform Using Pilvi™ Managing Pilvi™ Integrations Changelog This documentation is divided into following sections Pilvi™ Platform Sections Core Concepts Using Pilvi™ Getting Started Managing Pilvi™ Getting Started Integrations Service Integrations Site Integrations Changelog Changelog","tags":"","url":"en\/Overview.html"},{"title":"Requirements","text":"Table of Contents Browser support Pilvi™ Platform works optimally on displays with viewport width of over 360px. Browser support Pilvi™ Platform requires the web browser to have JavaScript support enabled LocalStorage support enabled The following web browsers are supported and expected to work without problems. Chrome Firefox Safari (Private browsing not supported) Edge Not specifically supported. May work partially. No support is provided. IE11 Unsupported browsers IE10 and earlier","tags":"","url":"en\/Pilvi™_Platform\/Requirements.html"},{"title":"Sections","text":"Table of Contents Shop Console Manager The user interface of the Pilvi Platform is separated into three sections: Shop, Console, Manager. Shop Online shop for buying products. Console Self-service portal for customers to manage their services, customer information and contracts. Manager Administration interface for managing customers, their services, products, orders and shop content.","tags":"","url":"en\/Pilvi™_Platform\/Sections.html"},{"title":"Core Concepts","text":"Table of Contents Site User User roles Profile Seller Profile Seller Profile with Site administration rights Product Service Site Referenced as Site Site, or a website, is a top level object that groups many other objects under it, such as Users and Profiles. Site is associated with a single domain. User Referenced as User User is a unique end-user with an email address. Users and their email addresses are unique within a Site. User can belong to one or more Profiles and have a different role in each. User roles User has a certain role in each Profile that it is connected to. Each role gives specific access rights within an Profile. Possible roles include Owner. Each Profile may have only one Owner. Owner is responsible for the Profile. Owner has same rights as Admin. Admin. Has full access to the Profile and its Services. Is allowed to make purchases on the Profile. User. Has read-only access to the Profile. May view Services but cannot make changes to them. Profile Referenced as Profile or Customer or Customer Profile Profile, is an entity that can purchase Products in the Shop manage bought Products as Services in the Console Profile may represent a Private person or a Company. Each User has at least one Private Profile. Profiles are contained within a Site and have one or more Users linked to it. Seller Profile Referenced as Seller Profile or Seller Seller Profile is an Profile with elevated privileges, which allow it to create Products on a Site. Seller Profile may put Products on sale and receive Orders for these Products. Seller Profile can: View Profiles that have bought Products which are owned by the Seller Profile View Services of the Profiles that have bought Products which are owned by the Seller Profile Seller Profile with Site administration rights Referenced as Site Administrator Seller Profiles with Site administration rights have access to additional functionality in the Manager user interface. Seller Profile that has Site admin access can make changes to the Site and manage other Seller Profile within the Site. Parts of the Site that Site admin has access include: Design Pages Settings Messaging Product Referenced as Product Products may be created by Seller Profiles. Products are contained within Site. Created Products are available for purchase in the Shop. Service Referenced as Service Services are Product instances that have been ordered. Services are contained within Site.","tags":"","url":"en\/Pilvi™_Platform\/Core_Concepts.html"},{"title":"Getting Started","text":"Create a Profile To use Pilvi Platform, you need to have a Profile on the Pilvi Platform Site you intend to use. Profile may be created by registering to the Site from the Sign up page, or by making an Order as a new Customer. Log in to Console When you have an Profile on the Pilvi Platform Site. You can login to the Platform using your email address and password. You can find the login form from the hover menu in the top right corner. You can also login via a dedicated login page. Each of the Sections have a login page available from the \/login URL path. The login pages differ only in the way the after login redirect takes the user. Shop Section login pilvi-platform-site-address\/login redirects the User to Shop front page. Console Section login pilvi-platform-site-address\/console\/login redirects the User to Console front page. Switching between sections After login, you can switch between Shop and Console Sections from the top of the left side menu. Changing Session modifiers Dependent on Site configuration. All modifiers might not be available on every Site From the bottom of the left side menu, you can: select the language to show the Site in select the currency to be used to show the prices select if the prices should have VAT included","tags":"","url":"en\/Using_Pilvi™\/Getting_Started.html"},{"title":"Making a Purchase","text":"You can purchase a Product from the Shop. The checkout process may vary between Products. Here are the main steps from the start to finish: Choose the Product from the Stop. Fill in the details needed for the Product. Login with with your existing credentials, or enter information for a new Profile. Make a payment if the Product needs one. Wait for the Service to be provisioned. The status of the ordered Services Order received. Waiting activation. The Order for the Service has been received, but the activation is still waiting in the queue or no payment has been received yet. Processing. The Service is being processed. The Service is being provisioned. Ready. The Service has been successfully provisioned and is now ready. Error. The Service provisioned failed. Please contact support to solve the issue. Products with trial period When you order a Product that has a trial period, the Product is activated immediately. If there is non-trial and trial Products on the same Order, the trial Products are activated immediately and the non-trial Products after Invoice of the Order is paid.","tags":"","url":"en\/Using_Pilvi™\/Making_a_Purchase.html"},{"title":"Invoices","text":"An Invoice represents a balance amount that you owe to the Seller. Invoice has one or more Invoice Items that detail the amount of balance that is due for the Services. Invoices are created for every purchase that involve non-trial products. Table of Contents Paying Invoices During Checkout in the Shop On the Invoice page in Console Automatically by a background process Overdue Invoices Purchases may happen when you create a new Order through the Order channel when a previously bought Service is to be renewed for the next period When an Invoice is paid, the related Services are activated or renewed. Paying Invoices Invoices may be paid in the following ways: During Checkout in the Shop On the Invoice page in Console Automatically by a background process During Checkout in the Shop Payment methods: Credit Card, Profile Balance. If you have enough Profile Balance to cover the expenses of the Invoice in full, the Invoice is paid by consuming your Profile Balance. On the Invoice page in Console Payment methods: Credit card. Automatically by a background process Payment methods: Recurring payment via Credit Card, Profile Balance. When an Invoice is created by a background process, your Profile Balance is consumed to reduce the final sum of the Invoice if you have auto-use enabled. You can alter this behaviour per Contract or with the Profile default value. Overdue Invoices If Invoice is not paid before the due date, the payment will be made from your Profile Balance if enough balance is available. If the Profile Balance is not enough to pay the Invoice, the Recurring payment method is used if it has been enabled. In case the Invoice cannot be paid, the Services will be expired and eventually discontinued","tags":"","url":"en\/Using_Pilvi™\/Invoices.html"},{"title":"Profile Settings","text":"Recurring payments To ensure that your Services will be continued, you can setup a Recurring payment method for your Customer Profile. By enabling the Recurring payments, your Invoices will be automatically paid from your Credit Card if not enough Profile Balance is available. Addresses Addresses are used to determine the country of the buyer and also as a means to speed up future checkouts by offering previously used addresses as an option.","tags":"","url":"en\/Using_Pilvi™\/Profile_Settings.html"},{"title":"Services","text":"Table of Contents States Trial period Cancellation Renewal Auto-renew Expiration Discontinuation Contracts Purchased Products will become visible on the Console, as Services. States At any particular time, a Service is in one of the following states: State Description WAITING_ACTIVATION The Service is created, but not yet provisioned. PROCESSING The Service is being provisioned or changes are being made to it. DISPATCHED The Service was created from a One-time Purchase Product (non-recurring), and it has been successfully provisioned. No other actions will be performed for this Service. OK The Service is successfully provisioned and is now active. SUSPENDED The Service is suspended. Access is limited while in this state. Possible reason: insufficient funds, Service misuse. ERRONEOUS The Service has experienced issues and may not be fully available. EXPIRED The Service has expired, it has been suspended and it is no longer accessible. The Service can still be renewed. DISCONTINUED The Service has been discontinued. The Service cannot be renewed, and it may be terminated at any given time. Trial period When Service trial period is nearing its end, an Invoice is created for the first billed period of the Service if auto-renew is enabled. If the Invoice was created, the payment is tried on the due date (Service expiration date), and on succesful payment the Service is renewed for the next period. Cancellation You may cancel a Service by disabling the auto-renew for it. To cancel a Service from the Console, proceed to the page of the Service that you'd like to cancel, and click on the 'Discontinue Service' button. If you still decide to continue to use the Service before it has been discontinued, you can click on the 'Continue Service' from the page of the Service. This will result in the creation of new Invoice that can be paid to renew the Service for the next period. Renewal Services are renewed by paying an Invoice that was created for the next billing period. Invoices are created before the Service expires, on the Service expiration date at the latest. Invoice creation times may vary between Sites. Auto-renew Services that have auto-renew enabled are automatically renewed for the next period (included on the next Invoice). Services that have been canceled (auto-renew disabled) will be excluded from the next periods Invoice, thus they will expire at the end of the current period. If you cancel a Service that has already been included in an Invoice for the next period, the Invoice will be reimbursed and a new Invoice reflecting the new state of the Contract will be created at a later time. Expiration Services will be expired when their expiration time is in the past. After the expiration date has passed, the Service may be put into EXPIRED state. The time period between the Service expiration time and the time the Service is put to EXPIRED state may vary between environments. While the Service is in EXPIRED state, it may still be renewed by paying the appropriate Invoice. Discontinuation Services will be discontinued when they have been in EXPIRED state for a predefined amount of time. This time period varies between Sites. When the Service is put to DISCONTINUED state, it cannot be renewed or restored. Contracts Contracts are used for grouping one or more Service. Services in the same Contract are renewed at the same time, and follow the same billing interval.","tags":"","url":"en\/Using_Pilvi™\/Services.html"},{"title":"Getting Started","text":"For information on how to use Pilvi™ Platform as a Customer, see Using Pilvi™ - Getting Started To manage Pilvi Platform, you need to have access to a Seller Profile on the Pilvi Platform Site you intend to manage. To have access to a Seller Profile, you need to have your own Pilvi Platform Site set up, or you can request access some existing Site as well. Log in to Manager You can login to the Platform using your email address and password. You can find the login form from the hover menu in the top right corner. You can also login via a dedicated login page. Each of the Sections have a login page available from the \/login URL path. The login pages differ only in the way the after login redirect takes the user. Shop Section login pilvi-platform-site-address\/login redirects the User to Shop front page. Manager Section login pilvi-platform-site-address\/manager\/login redirects the User to Manager front page. Switching between sections After login, you can switch between Shop and Manager Sections from the top of the left side menu.","tags":"","url":"en\/Managing_Pilvi™\/Getting_Started.html"},{"title":"Action Rules","text":"Table of Contents Default Action Rule Preset Conditions Primary conditions Secondary conditions Functions Action Rules are used to define and alter the behaviour of Pilvi™ Platform. Action Rules allow you to define Actions that will be performed when certain conditions are met. Action Rules are Site specific Rules that a Site Admin can set. Action Rules cannot alter critical system processes, such as Service life times. Example use cases for Action Rules: Sending email to Customers when some event occurs Sending a message to some 3rd party service when some event occurs Pilvi Platform provides a set of default Action Rules that give you fully working message workflow for your Customer. You can of course alter it as you see fit. Default Action Rule Preset Action Rule name Description Send email &quot;Customer order confirmation&quot; Send Order confirmation message for new Orders. Send email &quot;Service canceled&quot; Notify the Customer when a Service is canceled. Send email &quot;Services expiring soon&quot; Notify the Customer of expiring Services 10 days before expiration. Send email &quot;Service expired because no payment&quot; Notify the Customer when a Service is expired, because no payment was received. Send email &quot;Service expired because canceled&quot; Notify the Customer when a Service is expired, as was requested by the Customer. Conditions Primary conditions Name Triggers Additional parameters LOGIN_FROM_NEW_IP Immediately USER_CREATED Immediately ORDER_CREATED Immediately ORDER_ACTIVATED Immediately SERVICE_EXPIRED Immediately SERVICE_CANCELED Immediately SERVICE_DISCONTINUED Immediately SERVICE_EXPIRES_IN Scheduled (once a day) NUMBER SERVICE_HAS_BEEN_EXPIRED_FOR Scheduled (once a day) NUMBER X_TIME_UNITS_FROM_SERVICE_CREATION Scheduled NUMBER X_TIME_UNITS_FROM_SERVICE_TRIAL_END Scheduled X_TIME_UNITS_FROM_SERVICE_TRIAL_START Scheduled NUMBER X_TIME_UNITS_TILL_SERVICE_TRIAL_END Scheduled NUMBER X_TIME_UNITS_SINCE_USERS_LAST_LOGIN_TO_PILVI_PLATFORM Scheduled NUMBER Secondary conditions May only be used with Primary conditions Name Additional options SERVICE_IS_CANCELED SERVICE_IS_NOT_CANCELED SERVICE_EXPIRES_IN_DAYS SERVICE_HAS_BEEN_EXPIRED_FOR_DAYS RECURRING_PAYMENT_INFORMATION_IS_FILLED RECURRING_PAYMENT_INFORMATION_IS_NOT_FILLED Functions Name Additional parameters Required contexts SEND_EMAIL_TO_ADDRESS EMAIL None SEND_EMAIL_TO_USER User SEND_EMAIL_TO_PROFILE_ADMINS Profile or Service SEND_WEBHOOK_CALL ENDPOINT None","tags":"","url":"en\/Managing_Pilvi™\/Action_Rules.html"},{"title":"Analytics","text":"For integrating analytics tools, Pilvi™ Platform supports the following: Google Analytics Google Tag Manager Facebook Pixel Segment To enable an analytics provider, you'll need to enable it from the Settings. In Manager Go to Settings, open Analytics tab. Enable ANALYTICS_INTEGRATIONS_XXXXX_ENABLED. Where XXXXX is the name of the provider you want to enable. Fill in additional Preferences for the integration. For ex. Google Analytics ANALYTICS_INTEGRATIONS_GOOGLE_ANALYTICS_CODE.","tags":"","url":"en\/Managing_Pilvi™\/Analytics.html"},{"title":"Branding & Themes","text":"Themes Table of Contents Themes Site Product Cards Messages Pilvi Platform provides default themes that you can configure with variables to match with your Brand. The default themes allow you to set your own logo, change colors and modify the look with some additional variables. For more detailed theme adjustments you can also alter the theme with CSS or SCSS. Site We currently provide a single default theme that you can alter to your liking with variables. Product Cards We provide 10 different themes for you to choose from, and alter your liking with variables. Messages We currently provide a single default theme that you can alter to your liking with variables.","tags":"","url":"en\/Managing_Pilvi™\/Branding_&_Themes.html"},{"title":"Catalog","text":"Table of Contents Products Provisioning method Pricing Life-time Product Cards Product Card Groups Relations Categories Regions Brands Catalog contains sections that allow you to create and structure your Product Catalog. Products Products are orderable items that your Customers may purchase. Purchased Products become visible for the Customer as Services under the Profile the Product was purchased on. Products have a localized name optional plan name as well. Plan name is often used to separate different versions of the same Product, eg. Starter, Basic, Professional. Products have a localized description field that you can edit using a WYSIWYG editor. You can create content rich pages describing your products best features, using images and\/or videos. Provisioning method Provisioning method defines how the Product is provisioned when the Order is received and activated. Manual - Email. This provisioning method sends an email to the address defined by Preference: SERVICE_PROVISIONING_DEFAULT_EMAIL_ADDRESS with the Message Template: SERVICE_EMAIL_PROVISION. Automatic - PAITA. This provisioning method uses PAITA integration to provision the Service. PAITA integration needs to be setup before. See Service Integrations. Pricing Products have 3 different pricing options: Ask for an Offer. The Product cannot be purchased. Instead, contact information is presented. One-time purchase. A single price may be set. The Service will be provisioned, but no actions will be performed by Pilvi after that. Use cases: One-time purchase to receive something in exchange. Recurring. Product has a price for a certain period. The usage of the Service may be continued after the initially paid period has ended. Product may have a setup cost, that is paid only on the first order. Product may also have a Trial period. Life-time Product may be externally managed. Externally managed Products are not visible or purchasable in the Shop can cannot have a price. Externally managed Products are used when you want your Services to be provisioned from an outside source. Product Cards Product Cards may be used to provide different views to your Products. A Product may have many Product Cards that each can have a different theme and varying fields showing information about the Product. Product Cards are components that can be embedded to external websites. Product Card Groups Product Card Groups may be used to group Product Cards from different Products into a single element. Product Card Groups enable you to show a compare view of the Products, which shows what feature is available for each Product. Product Cards Groups are components that can be embedded to external websites. Relations Relations may be added between the products. In the Shop, these relations show as product recommendations in Product Detail and Product Configure. There are two relation types, group and single. If a new group relation is created, the current and the selected target product will be added to the group. More products can be added to the existing group. In the Shop, the products in the group relation will be shown as recommendations for each product in the group. A product may belong to several groups and single relations. The Single relation type is unidirectional. The product in the relation (target product) will be shown for the current product in the Shop. The current product won't be shown when inspecting the target product. Taxonomy types Taxonomy type Intended use case Where is shown? Variant Variations of the same Product. Used for different Product Plans for ex. Product Detail Page, under &quot;Other versions of this product&quot; and a select box above the product price. Related Products that are related or otherwise recommended with this Product. Product Detail Page, under &quot;Recommended products&quot; Competing Competing or similar Products. Product Detail Page, under &quot;Competing products&quot; Compatible Products that may be bought and used together. Product Configure Page, as checkboxes. If selected, they will be added to Cart at the same time. Categories Categories allow you to group your Products in the Shop with any criteria you want. Categories are visible in the Side menu when in the Shop section. Regions Regions are another means of grouping your Products based on geographical location. Regions are shown separately from Categories in the Side menu. Brands Regions are another means of grouping your Products based on the provider of the Product. Brands are shown separately from Categories in the Side menu.","tags":"","url":"en\/Managing_Pilvi™\/Catalog.html"},{"title":"Content Management","text":"Pages Table of Contents Pages Variables Side menu links System Pages Default contents System Page Variables Sections Cart Ready page Examples Simple web pages can be created by the Site admin. Page has name, i.e. slug localized title localized content. The Page slug is unique within a Site and may only contain lowercase letters a-z, numbers and dashes, since it is used in URL. The title is plain text and editable. The content of the Page is HTML and can be edited with a WYSIWYG editor. When a page has been created in Manager, it is accessible in Shop via URL \/pages\/:name e.g. \/pages\/about-this. Note that a non-active page won't be visible in the Shop. For every Shop, a predefined set of default pages are created privacy-policy terms-of-use contact These can always be reset back to the default title and content with &quot;Reset page&quot;. Reset will affect all locales of the Page. Variables Variables can be used in the Page title and content. A variable is added in double-braces, e.g. {{company.name}}. See list of available variables below: Variable Name Where the Value comes from company.name Preference: COMPANY_NAME company.email Preference: COMPANY_EMAIL company.address Preference: COMPANY_ADDRESS company.zipcode Preference: COMPANY_ZIP_CODE company.city Preference: COMPANY_CITY company.country Preference: COMPANY_COUNTRY company.phone Preference: COMPANY_PHONE company.site.url Preference: COMPANY_SITE_URL company.logo.url Preference: COMPANY_LOGO_URL company.vat.id Preference: COMPANY_VAT_ID site.name Site name. My Shop site.domain Site domain. ex. my-shop.saas.pilvi.com user.email User email when the user is logged in Side menu links Side menu links may be added for privacy-policy, terms-of-use and contact Pages. See Preferences starting with FRONTEND_SIDEMENU_LINK_. System Pages Many System Pages can be customized by the Site admin. For example Product Detail, Product Configure, Login, Register, and Cart pages are supported. Each System Page can have several System Page Blocks, typically a Top and a Bottom block. The Top block is located just below the header and the Bottom block below the other content. The contents of the System Page Blocks can be edited in Manager as localized WYSIWYG fields. Default contents Some of the System Page Blocks have default contents. These contents can be edited similarly to any block. System Page Variables Variables can be used in System Page Blocks in the same way as in Pages. In addition to the Pages variables, System Pages may have page specific variables available. On Product Configure and Product Detail pages the following variables are available: Variable Name Where the Value comes from product.id The current product ID product.no The current product number product.name The current product localized name product.plan The current product localized plan Sections A System Page Block may contain sections, which visibility depends on the section variable values. The system defines these section variables on some of the System Pages. A section consists of section start, content, and section end. For example: {{#section.order_fail}} Oops, something went wrong {{\/section.order_fail}} The text is included only if variable section.order_fail value is true. Sections may be nested. Cart Ready page On this page, when section.order_success is true, the order was received successfully. Only one of the sections inside order_success is true at a time. Section (1st level) Section (2nd level, only one present at a time) section.order_success section.order_payment_receivedsection.order_payment_invoicesection.order_payment_not_neededsection.order_payment_fail section.order_failed Examples See the default System Page Block contents, for example Product Configure Top block. For more advanced example, see Cart Ready Top block.","tags":"","url":"en\/Managing_Pilvi™\/Content_Management.html"},{"title":"Customers","text":"Customers are Profiles (or Customer Profiles) which have ordered Products you have put for sale. In Manager you can see the list of all your Customers by clicking the Customers link on the side menu. From each Customer's page you can see details of its status, its Services, Invoices etc.","tags":"","url":"en\/Managing_Pilvi™\/Customers.html"},{"title":"Integrations","text":"For information on supported integrations options, see Integrations - Service Integrations and Integrations - Site Integrations","tags":"","url":"en\/Managing_Pilvi™\/Integrations.html"},{"title":"Invoices","text":"For information on how to use Invoices as a Customer, see Using Pilvi™ - Invoices","tags":"","url":"en\/Managing_Pilvi™\/Invoices.html"},{"title":"Messaging","text":"Message templates Messages templates can be defined to be used with Action Rules. Pilvi™ provides a default set of templates for you to get started with, but you can modify the templates to your liking or create new templates. Table of Contents Message templates Variables All templates Template specific User context Profile context Service context Order context Contract context Product context Variables A variable is added in double-braces, e.g. {{company.name}}. See list of available variables below. Note properties[].value needs to be wrapped in triple-braces so the HTML is properly rendered for all Property value types. Variable availability varies between messsage template types. Available contexts define which variables are available. Message Template Type Context USER User PROFILE User Profile SERVICES_EXPIRING User Profile SERVICE User Profile Service SERVICE_CANCELED User Profile Service SERVICE_EXPIRED_BECAUSE_UNPAID User Profile Service SERVICE_EXPIRED_BECAUSE_CANCELED User Profile Service CUSTOMER_ORDER_CONFIRMATION User Profile Order SELLER_ORDER_CONFIRMATION User Profile Order SERVICE_EMAIL_PROVISION Profile Service All templates Variable Name Description \/ Value source company.name Preference: COMPANY_NAME company.email Preference: COMPANY_EMAIL company.address Preference: COMPANY_ADDRESS company.zipcode Preference: COMPANY_ZIP_CODE company.city Preference: COMPANY_CITY company.country Preference: COMPANY_COUNTRY company.phone Preference: COMPANY_PHONE company.site.url Preference: COMPANY_SITE_URL company.logo.url Preference: COMPANY_LOGO_URL company.vat.id Preference: COMPANY_VAT_ID message.title Title\/Subject of the message template site.name Site name. My Shop site.console.url Site Console Root URL. ex. my-shop.saas.pilvi.com\/console site.console.profile.url Site Console Profile Page URL. ex. my-shop.saas.pilvi.com\/console\/profile site.console.invoices.url Site Console Invoices Page URL. ex. my-shop.saas.pilvi.com\/console\/invoices site.console.services.url Site Console Services Page URL. ex. my-shop.saas.pilvi.com\/console\/services site.manager.url Site Manager URL. ex. my-shop.saas.pilvi.com\/manager site.domain Site's domain ex. my-shop.saas.pilvi.com site.shop.url Site's shop url ex. my-shop.saas.pilvi.com year Current year Template specific Message Template Type Variable Name Description \/ Value source SERVICES_EXPIRING numberofdaysbeforeexpire Days before Service Expiration Date (prev. numberofdaysbeforeexpire) SERVICES_EXPIRING expiringservices List of expiring services. Contains same variables as Service context User context Variable Name Description \/ Value source user.id User Id user.email User Email user.name User Full Name user.firstname User Firstname user.lastname User Lastname Profile context Variable Name Description \/ Value source profile.name Profile Name profile.id Profile Id profile.no Profile No profile.balance Profile Balance profile.debt Profile Debt profile.address.delivery.street Profile Delivery Address Street profile.address.delivery.city Profile Delivery City profile.address.delivery.zipcode Profile Delivery Zip Code profile.address.delivery.country Profile Delivery Country profile.address.invoice.street Profile Invoice Address Street profile.address.invoice.city Profile Invoice City profile.address.invoice.zipcode Profile Invoice Zip Code profile.address.invoice.country Profile Invoice Country profile.services List of active Services on the Profile. Contains same variables as Service context Service context Variable Name Description \/ Value source service.name Service Name service.id Service Id service.no Service No service.url Service Page URL service.expiredate Service Expiration Date service.properties[].name Service Property Name service.properties[].label Service Property Label service.properties[].value Service Property Value service.product The Product of the Service. Contains same variables as Product context Order context Variable Name Description \/ Value source order.id Order ID order.no Order Number order.created Order creation time, localized order.total Order Total order.totalwithvat Order Total With VAT order.vat.rate Order VAT Rate order.vat.amount Order VAT Amount order.paymentmethod Payment method order.reference Customer reference order.additionalinfo Order additional info order.products List of Products in Order. Contains same variables as Product context Contract context Variable Name Description \/ Value source contract.id Contract ID contract.no Contract Number contract.startdate Contract start date contract.invoicedtill Contract invoiced till date contract.paidtill Contract paid till date contract.reference Contract customer referenced contract.created Contract creation time, localized Product context Variable Name Description \/ Value source Format product.name Product Name string product.plan Product Plan string product.id Product Id number product.no Product Number number product.image.url Product Image URL string product.productgroup.name Product Group Name string product.properties[].name Product Property Name string product.properties[].label Product Property Label string product.properties[].value Product Property Value string product.billingperiod Product Billing Period 1 month product.billingprice Product Billing Price (price * billingperiod) 0.00 product.billingpricewithvat Product Billing VAT Price (price * billingperiod) 0.00 product.trialperiod Product Trial Period 1 month product.price Product Price (price in product price interval) 0.00 product.priceperiod Product Price Period 1 month product.pricewithvat Product VAT Price 0.00","tags":"","url":"en\/Managing_Pilvi™\/Messaging.html"},{"title":"Payments","text":"Payment options Table of Contents Payment options Stripe Invoice Currently supported payment methods: Stripe Invoice Stripe Stripe allows you to receive payments via credit cards. To enable Stripe as a payment method, you'll first need to connect a Stripe account to your Pilvi™ Site. In Manager From the side menu, under Settings, click Payment. Click Connect. After this, you will be redirected to the Stripe site and you are asked to fill information regarding your billing. At this point you may also create a new account to Stripe if you don't have one already. Go to Settings, and enable PAYMENT_METHOD_STRIPE_ENABLED You can disconnect your Stripe account from Pilvi™ at anytime. Note: after this you will not receive any more payments from Pilvi™. Payment to Stripe will be done in the base currency of the Platform. For the Pilvi SaaS offering this currency is EUR. Invoice Invoice allows your Customers to make orders and pay them at a later date. To enable Invoice as a payment method, you'll need to enable the payment method from the Settings. In Manager Go to Settings. Enable PAYMENT_METHOD_STRIPE_ENABLED.","tags":"","url":"en\/Managing_Pilvi™\/Payments.html"},{"title":"Preferences","text":"Table of Contents List of editable Preferences General User Authentication and Registration Service life time UI and Features Analytics Preferences define the configuration of your Site. By altering Preference values, you can alter the behaviour of your Site. Some Preferences provide only read-only information and are not editable by you. Preference value types are one of the following: STRING. Text value. NUMBER. Numeric value. BOOLEAN. Checkbox toggle. List of editable Preferences General Preference Name Value Type Description COMPANY_ADDRESS STRING Street address of the company. COMPANY_CITY STRING City of the company. COMPANY_COUNTRY STRING Country of the company. COMPANY_EMAIL STRING Email address for the company. COMPANY_LOGO_URL STRING URL to the logo of the company. COMPANY_NAME STRING Name of the company. COMPANY_PHONE STRING Phone number for the company. COMPANY_SITE_URL STRING Website URL of the company COMPANY_VAT_ID STRING VAT ID of the company COMPANY_ZIP_CODE STRING Zip code of the company DEFAULT_LOCALE_CODE STRING Default locale for the Site to use for root URL. Default en_US. User Authentication and Registration Preference Name Value Type Description SITE_REGISTRATION_ENABLED BOOLEAN Allow new users to register to the Site AUTH_PROVIDER_LOCAL_ENABLED BOOLEAN Enable Local Credential Authentication on the Site AUTH_PROVIDER_AZURE_AD_B2C_ENABLED BOOLEAN Enable Azure AD B2C Authentication on the Site AUTH_PROVIDER_AZURE_AD_B2C_TENANT_NAME STRING Name of the Tenant in Azure AD B2C. The subdomain part of the domain. AUTH_PROVIDER_AZURE_AD_B2C_CLIENT_ID STRING Client ID from Azure AD B2C AUTH_PROVIDER_AZURE_AD_B2C_CLIENT_SECRET STRING Client Secret from Azure AD B2C AUTH_PROVIDER_AZURE_AD_B2C_POLICY_FOR_LOGIN STRING Name of the Policy to use for Login AUTH_PROVIDER_AZURE_AD_B2C_POLICY_FOR_REGISTER STRING Name of the Policy to use for Register Service life time Preference Name Value Type Description DAYS_FROM_EXPIRE_TO_DISCONTINUE NUMBER The count of days before a Service is Discontinued after being Expired. Default 30. INVOICE_SERVICE_BILLING_GROUP_DAYS_BEFORE_EXPIRE NUMBER The count of days before the Service expire time that the next Invoice is created. Default 0, Invoice is created on the expire date. SERVICE_EXPIRATION_DELAY_IN_DAYS NUMBER The offset of days for setting the Service in to EXPIRED state, after the expire time has been reached. Default 0, Service is set to EXPIRED state on the date of the expiration. UI and Features Preference Name Value Type Description FRONTEND_SHOP_CATEGORY_PRODUCT_DEFAULT_ORDER STRING Define product ordering in category. Possible values: cheapest-first (Price - lowest first), cheapest-last (Price - highest first), position-id (Recommended) FRONTEND_SHOP_FRONT_PAGE_ALIAS_PATH STRING URL Path which is shown on the front page. ex. \/pages\/terms-of-use FRONTEND_SIDEMENU_LINK_PRIVACY_POLICY_ENABLED BOOLEAN Show side menu link to privacy-policy Page. FRONTEND_SIDEMENU_LINK_PRIVACY_POLICY_EXTERNAL_ENABLED BOOLEAN Use external link for the side menu link of Privacy Policy. If false, internal Page is used. FRONTEND_SIDEMENU_LINK_PRIVACY_POLICY_EXTERNAL_LINK STRING URL of an external Contact page. FRONTEND_SIDEMENU_LINK_TERMS_OF_USE_ENABLED BOOLEAN Show side menu link to terms-of-use Page. FRONTEND_SIDEMENU_LINK_TERMS_OF_USE_EXTERNAL_ENABLED BOOLEAN Use external link for the side menu link of Terms of Use. If false, internal Page is used. FRONTEND_SIDEMENU_LINK_TERMS_OF_USE_EXTERNAL_LINK STRING URL of an external Terms of Use page. FRONTEND_SIDEMENU_LINK_CONTACT_ENABLED BOOLEAN Show side menu link to contact Page. FRONTEND_SIDEMENU_LINK_CONTACT_EXTERNAL_ENABLED BOOLEAN Use external link for the side menu link of Contact. If false, internal Page is used. FRONTEND_SIDEMENU_LINK_CONTACT_EXTERNAL_LINK STRING URL of an external Contact page. PAYMENT_METHOD_INVOICE_ENABLED BOOLEAN Show Invoice as a payment option PAYMENT_METHOD_STRIPE_ENABLED BOOLEAN Show Stripe as a payment option Analytics Preference Name Value Type Description ANALYTICS_INTEGRATIONS_GOOGLE_ANALYTICS_ENABLED BOOLEAN Enable Google Analytics tracking. ANALYTICS_INTEGRATIONS_GOOGLE_ANALYTICS_ID STRING Tracking code for Google Analytics. ANALYTICS_INTEGRATIONS_GOOGLE_TAG_MANAGER_ENABLED BOOLEAN Enable Google Tag Manager. ANALYTICS_INTEGRATIONS_GOOGLE_TAG_MANAGER_ID STRING TrackId for Google Tag Manager. ANALYTICS_INTEGRATIONS_FACEBOOK_PIXEL_ENABLED BOOLEAN Enable Facebook Pixel tracking. ANALYTICS_INTEGRATIONS_FACEBOOK_PIXEL_ID STRING PixelID for Facebook Pixel. ANALYTICS_INTEGRATIONS_SEGMENT_ENABLED BOOLEAN Enable Segment tracking. ANALYTICS_INTEGRATIONS_SEGMENT_KEY STRING API Write Key for Segment. ANALYTICS_INTEGRATIONS_PILVI_ENABLED BOOLEAN Enable Pilvi Analytics tracking. Planned ANALYTICS_INTEGRATIONS_PILVI_ID STRING Pilvi Tracking for Facebook Pixel. Planned","tags":"","url":"en\/Managing_Pilvi™\/Preferences.html"},{"title":"Properties","text":"Properties describe the characteristics of your Product or Customer. With Properties you can Add features to your Products, that are shown in the Shop and are comparable between Products. Add input fields to Product's configuration phase in the checkout process. Add input fields for requesting Customer information in the checkout process. Properties are also used for storing and relaying information between Pilvi and Service Integration providers. Table of Contents Property values Property validations Property categories Product Properties Profile Properties Adding New Profile Properties Required Accessibility in Shop\/Console\/Manager Show for (Profile Type) Position Properties have a unique Property Name, ex. site-1-my.example.property a localized Property Label, ex. My Example Property a Property Type, which defines where the Property receives its value. a Property Value Type, which defines the type of the value. See list of possible Value Types below. a Property value. Property values Property has a Value type, that cannot be altered after its creation: Checkbox. Yes\/No toggle. Shown in the UI as a checkbox. Text. Text value. Shown in the UI as a text input field. Selectbox. Text option. Shown in the UI as a selectbox. Number. Numeric value. Shown in the UI as a number input field. Number Range. Numeric value from a certain range. Shown in the UI as a slider. Textarea. Multiple lines of text. Shown in the UI as a textarea input field. Date. Date value with month, day, and year. Shown in the UI as a date picker. Property validations Property values may also have an optional validation that restricts the value of the Property. Value Type Validation Type Validation Name STRING EMAIL Email. Spec STRING URL URL. Spec STRING DOMAIN Domain. Spec STRING HOSTNAME Hostname. Spec STRING PHONE Phone NUMBER INTEGER Integer NUMBER DECIMAL_2 Two Decimals 0.00 Property categories Properties are divided into to categories: Product and Profile. Product Properties Product Properties define a Product. Product Properties may have their value set on the Product or on the Service. Names of the Product Properties that are created by a Seller are automatically prefixed with a Seller ID. Ex. seller-1- Profile Properties Site Administrator can define and set the values of the Profile Properties in Manager. Profile Property values may be required from the user in Shop Sign Up and Shop Cart. User can also see and change the values in Console. In addition to the Property value type and validation, Site Administrator may set Profile Property attributes for the visibility, validation, helpers, and localizations. Names of the Profile Properties are automatically prefixed with the Site ID. Ex. site-1- Adding New Profile Properties New Profile Properties can be added in Customers - Profile Properties. The name will be used by default for all the locales. Required If Required is set, User has to input a value before proceeding. Accessibility in Shop\/Console\/Manager Profile Property accessibility can be defined separately for Shop (Sign Up, Cart), Console (User Settings), and Manager (Customer Profiles). The accessibility options for each are: Hidden. Profile Property is not visible. Visible. Profile Property value is shown. Editable. Profile Property value is visible and may be edited. Show for (Profile Type) Profile Property access can be further limited based on the profile type. Person. User with the profile type Person can see\/edit the property. Business. User with the profile type Business can see\/edit the property. All. Both Person and Business users can see\/edit the property. Position Position number can be used to sort Profile Properties on the forms in ascending order. The default is 0. Note that properties with the same position number are not in any specific order within that position.","tags":"","url":"en\/Managing_Pilvi™\/Properties.html"},{"title":"User Authentication and Registration","text":"Table of Contents Registration Authentication Credential Authentication (Local) Credential Authentication to External Provider Authentication via 3rd Party Provider Azure AD B2C Registration You can disallow the registration of new accounts on the Pilvi Platform via Preference: SITE_REGISTRATION_ENABLED. Authentication Pilvi Platfrom has support for three different types methods for authenticating a User Credential Authentication (Local) Credential Authentication to a External Provider Authentication via 3rd Party Provider Credential Authentication (Local) Pilvi Platform's local User database. Authentication is performed against the Pilvi User database. Enabled by Default. Can be disabled via Preference: AUTH_PROVIDER_LOCAL_ENABLED Credential Authentication to External Provider Pilvi Platfrom forwards authentication requests to an External Provider, such as Active Directory or LDAP. Contact sales if interested in AD\/LDAP authentication Authentication via 3rd Party Provider Pilvi Platfrom redirects the User to a 3rd Party Providers site, where the actual login (or register) action is performed. After a succesful authentication, the User is forwarded back to Pilvi Platform. Currently Supported 3rd Party Authentication Providers are: Azure AD B2C Azure AD B2C Azure AD B2C is a cloud identity and access managmenet service, which allows you to connect various different identity providers. Azure AD B2C allows your users to access your service using social media accounts. To enable an Azure AD B2C integration, you'll need to enable it from the Settings. Azure AD B2C integration currently support Login and Register. In Manager Go to Settings, open Analytics tab. Fill in additional Preference values for the integration. AUTH_PROVIDER_AZURE_AD_B2C_TENANT_NAME. AUTH_PROVIDER_AZURE_AD_B2C_CLIENT_ID. AUTH_PROVIDER_AZURE_AD_B2C_CLIENT_SECRET. AUTH_PROVIDER_AZURE_AD_B2C_POLICY_FOR_LOGIN. AUTH_PROVIDER_AZURE_AD_B2C_POLICY_FOR_REGISTER. Finally, enable AUTH_PROVIDER_AZURE_AD_B2C_ENABLED.","tags":"","url":"en\/Managing_Pilvi™\/User_Authentication_and_Registration.html"},{"title":"Service Integrations","text":"Service integrations to external service providers allow you to provision your Products to your Customers. Pilvi Automatic Integration Technology API (PAITA) PAITA aka The Pilvi Automatic Integration Technology API is an API interface designed for partners to easily sell and manage their SaaS products. For example it provides automatic provisioning, interface usage statistics, vast management options for products and services. PAITA can be also used to provide a third-party SaaS services and products for partners own Pilvi shop. PAITA is composed from two parts: Service Integration API Specification and Service Management API The Service Integration API Specification provides an interface for the partner to develop in order for Pilvi to automatically integrate into the partner’s cloud service. The Service Management API provides an interface for the partner to call in order to notify Pilvi of changes to Services. Service Management API is a supplementary API meant to be used with a Service Integration API Implementation. You can find more information and specific instructions for these API parts from links below: Service Integration API Specification Service Management API","tags":"","url":"en\/Integrations\/Service_Integrations.html"},{"title":"Site Integrations","text":"Table of Contents Zapier Authentication Azure AD B2C Analytics Site integrations allow you to integrate your Site into external services to extend with additional functionalities. Zapier Zapier integration allows any user from zapier.com to receive data (by a trigger every 15 minutes) about new Pilvi Services, Products and (Customer) Profiles. Currently supported Zapier Triggers for getting Pilvi data are: New Service New Product New Customer Profile To setup Zapier integration with Pilvi, you need to create a Zapier Zap at zapier.com, and use Pilvi app in the Zap. To use the Pilvi Zapier app, you need to provide the following authentication details: Site identifier API key API domain (use the default) The values for these fields need be created on Pilvi Platform, and copied into Zapier: To create or check the API key, in Manager From under the 'System' side menu item, open Zapier Integration page. Click &quot;Create new Zapier API key&quot; button. Existing Zapier API key will be removed and will no longer be valid. A new Zapier API key will be created. Previous integrations between Zapier and Pilvi Platform after creating new Zapier API key will no longer work. Copy API key and Site identifier into Zapier Authentication Azure AD B2C For information on how to use Azure AD B2C for authentication, see Managing Pilvi™ - User Authentication and Registration page Analytics Currently supported analytics providers Google Analytics Google Tag Manager Facebook Pixel Segment For information on how to enable 3rd party analytics, see Managing Pilvi™ - Analytics page","tags":"","url":"en\/Integrations\/Site_Integrations.html"},{"title":"Webhooks","text":"Currently Webhooks may only be triggered via Action Rules","tags":"","url":"en\/Integrations\/Webhooks.html"},{"title":"Changelog","text":"Pilvi™ Platform Changelog (2019-04-12) Platform version 1.5.5 Fixes Webhook: Added missing profile data under the order Trim Profile Property value type STRING leading and trailing whitespaces (2019-04-11) Platform version 1.5.4 Changes Payex: Canceling the payment now returns to Cart instead of the Shop frontpage (2019-04-10) Platform version 1.5.3 Changes Webhook: Added invoice.id, invoice.no, reference and customer_reference to invoice data and changed contracts reference to customer_reference in webhooks contents Fixes Fix for not correctly handling all payment success cases (2019-04-09) Platform version 1.5.2 Changes New Property value type FILE_URL and Property value type FILE renamed to FILE_BASE64 FILE_URL's value is shown as link in emails, triple braces are needed around the value in the message template Webhooks now pass the Property value as an array if the Property has several values Added Property label for email contexts and webhooks Fixes Fix for an error in handling the Customer provided reference Fix for Cost summary VAT detection on the Cart Payment stage Fixes for Analytics implementation. Analytics.page is now called correctly on every virtual page change Fix for email Property values not having localized values with Property value type Selectbox and Selectbox multiple T570 Fix for Product description sometimes not showing correctly on Shop Product listings (2019-04-04) Platform version 1.5.1 Fixes Cart Payment stage Remember selected payment method when moving back and forth in the checkout process Translations Payex reference number handling (2019-04-03) Platform version 1.5.0 Changes T426 Recommendation System T452 Support of Payex credit card payment method T434 Widget for Property value type DATE T436 Widget for Property value type FILE Product Properties moved under Catalog from the Settings Hide decimal zeros if price can be presented as an integer (2019-03-27) Platform version 1.4.0 Changes T500 Added support for Paytrail payment method Adjustments to Price and Cart Summary presentation Added edit button to Product Configure page, similarly as in the Product Detail page. Fixes Do not immediately show all validation errors, only after user interaction T568 Fix for ActionRules not triggering as expected when using multiple expiration rules Fixed header Cart price not updating as expected Theme fixes Highlight links in lists with Primary 1 color CollectionEditor font-size fixes Checkbox label placement fixes Updated tooltip icon with transparency Removed unnecassary Name and Email fields from the Invoice Payment address creation Trim leading and trailing whitespaces from name and email during Sign up (2019-03-15) Platform version 1.3.0 Changes T436 New Property Value Type: FILE (BASE64) DATE Property Value Type now defaults to current date as the minimum value Allow VAT Number to be set in the Finnish Y-tunnus format during Sign up Fixes T483 Fixed an error that prevented Seller Order confirmation from being sent occasionally Fix for Profile addresses not being reloaded when changing Profile Show asterisk characters for all required fields on Sign up Small fixes, translation corrections (2019-03-13) Platform version 1.2.2 Changes Changed how prices are shown by default Made the VAT toggle more clear Cart: swapped Price and Period columns Fixes Fixed an error that prevented new ActionRules functions from being saved on some Sites Enhanced HTML escaping on the checkout process Cart summary adjustments (2019-03-06) Platform version 1.2.1 Changes Webhook format fixes ORDER_ACTIVATED Action Rule Condition is now available (2019-02-26) Platform version 1.2.0 Changes T396 Added Call-to-Action buttons to Product Cards T540 Changes to Cart Summary presentation T458 Added Action Rule function for making Webhook calls T447 New Product Property: Selectbox multiple T555 Moved fixed buttons to the bottom of body on the Checkout process T493 Show Cart content in every stage during the Single Purchase process Fixes T545 Sidemenu footer translation and layout fixes T546 Product Clone function fixes T419 Property helpers not correctly set on all Properties T359 Fix for Product being re-added to Cart when going back via Browser back button T418 Fix for default email template client compatibility Small UX fixes (2019-01-30) Platform version 1.1.2 Changes T462 Allow Property Price Configuration for Single Purchase Products Fixes T515 Prevent Product price period unit auto conversion T512 UX fixes for Zapier integration T375 Paper cut bugs Moved Categories under Catalog menu in Manager Swapped Products and Locales tabs on Manager Categories Detail page. Made the Products listing the default tab Collection Editor sorting works now works correctly after saving data Fixed WYSIWYG implementation for Categories Page and corrected the content text alignment Product Properties are hidden on the Service Detail page Product image width fix for IE11 Cart style adjustments for mobile (2019-01-15) Platform version 1.1.1 Fixes T395 Adjustments for register page UI T492 Show Profile VATID on Profile Detail Page T491 Fixes for enhanced ecommerce analytics Fixed an error that occurred when enabling Google Tag Manager Register page is no longer shown when SITE_REGISTRATION_ENABLED=false (2019-01-08) Platform version 1.1.0 Changes T363 Profile Properties T470 Customizable System Pages T402 Added Ordered By info to Services and Orders T471 Use abbreviations for periods in places with limited space T445 New Property Value Type: TEXTAREA T434 New Property Value Type: DATE T432 Adjustments for CollectionEditor styles Fixes T510 Fix for User created times showing a wrong time. Fix for registering via Azure AD B2C with Facebook account. (2018-12-18) Changes T423 Azure AD B2C integration T385,T389 New Category Product ordering option that allows you to define Product positions manually. T376 Action Rule condition to limit by a Product T359 Skip initial Product configuration phase if there is nothing to configure Fixes T427 'Previous' button was not shown on Cart Customer phase T479 Fixed an error that prevented the add of new Properties in certain edge cases. (2018-10-14) Changes T384 Allow Categories to be sorted on the side menu T390 Added the possibility to modify the category content text to site admins. Fixes T411 Fixes for example products T416 isVatIncluded value sometimes gives wrong result (2018-09-14) Changes T372 Vat id validation T375 Added FRONTEND_SHOP_FRONT_PAGE_ALIAS_PATH Preference. Fixes T375 Paper cut fixes. Many small fixes for usability. (2018-09-03) Changes T371 New common message variables site.domain and site.shop.url (2018-08-20) Changes T370 Private Profile is always created for every new User. Primary Invoice Address is added for new and existing Profile. T242 Manager System Settings now shows Boolean values as checkboxes Fixed a bug that prevented the sending of registration and password reset emails on some Sites. Improved price update to be faster (2018-08-08) Changes T88 Added Site specific numbering for top level objects (Services,Profile,Product,Orders,Invoices) Renamed (Account) Credits to Account Balance. Usage based billing now adds to Account Debt, which needs to be paid off using Account Balance or other payment methods Revised Service lifetime states and process. New states: WAITING_ACTIVATION, when Service is created but the Order is not yet paid EXPIRED, when Service has passed its expiration time DISPATCHED, for One-time purchase products. Services are not active after the initial activation. Revised Action Rules for all Sites to reflect the changes in Service lifetime process. New default message templates to reflect the changes in Service lifetime process Shop: Background changes for the checkout process. Services are now activated behind the scenes when the payment is received. Shop: Added an option for ordering with an Invoice. Invoice needs to be paid through the Console to activate the Services. Console: Added new top level listings for Orders, Invoices, Contracts Console Added the ability to pay Invoices using a Credit Card (Stripe). Invoices may also be paid using the Account Balance. Console: Invoice is automatically created for the next period if the Service is set to be continued Manager: Added new top level listings for Orders, Invoices, Contracts Manager: Product Pricing options Free and One-time combined to a new option called &quot;One-time Purchase&quot;. Services created from a One-time Purchase products are provisioned and not managed by Pilvi Platfrom after that. Other changes T83 Site Administrator can now enable the following analytics: Google Analytics, Google Tag Manager, Facebook Pixel. T126 Added Product clone functionality Fixes a lot of small fixes here and there (2018-05-24) Changes T281 Added Zapier integration. Triggers for new Services, Product, Customer Profiles T343 Added support for Customer defined Pages T327 Changed edit button logic and texts. Add button is now shown only in View mode. In Edit mode, the text on the Edit button is changed to 'Cancel' T287 Platform default message templates are now stored separately from other templates T357 Trailing slashes are ignored by default Fixes T355 Fixed a bug where the WYSIWYG editor failed to initialize after multiple sequential uses","tags":"","url":"en\/Changelog.html"},{"title":"Pilvi™ SaaS Updates","text":"(2019-04-15) Pilvi™ Platform updated to version 1.5.5. See Changelog for details. (2019-04-09) Pilvi™ Platform updated to version 1.5.2. See Changelog for details. (2019-04-01) Pilvi™ Platform updated to version 1.4.0. See Changelog for details. (2019-03-19) Pilvi™ Platform updated to version 1.3.0. See Changelog for details. (2019-03-05) Pilvi™ Platform updated to version 1.2.0. See Changelog for details. (2019-02-12) Pilvi™ Platform updated to version 1.1.2. See Changelog for details. (2019-01-15) Pilvi™ Platform updated to version 1.1.1. See Changelog for details.","tags":"","url":"en\/Pilvi™_SaaS_Updates.html"},{"title":"Overview","text":"Pilvi™ Platform TODO Finnish documentation currently not available. Please use the English version meanwhile.","tags":"","url":"fi\/Overview.html"}]}