{"pages":[{"title":"Pilvi Platform Documentation","text":"Welcome to Pilvi Platform Documentation! This documentation describes the key functionalities and features of Pilvi™ Platform. DRAFT","tags":"","url":"index.html"},{"title":"Overview","text":"Pilvi™ Platform Table of Contents Pilvi™ Platform Using Pilvi™ Managing Pilvi™ This documentation is divided into following sections Pilvi™ Platform Sections Core Concepts Using Pilvi™ Getting Started Managing Pilvi™ Getting Started","tags":"","url":"en\/Overview.html"},{"title":"Sections","text":"Table of Contents Shop Console Manager The user interface of the Pilvi Platform is separated into three sections: Shop, Console, Manager. Shop Online shop for buying products. Console Self-service portal for customers to manage their services, customer information and contracts. Manager Administration interface for managing customers, their services, products, orders and shop content.","tags":"","url":"en\/Pilvi™_Platform\/Sections.html"},{"title":"Core Concepts","text":"Table of Contents Site User User roles Profile Seller Profile Seller Profile with Site administration rights Product Service Site Referenced as Site Site, or a website, is a top level object that groups many other objects under it, such as Users and Profiles. Site is associated with a single domain. User Referenced as User User is a unique end-user with an email address. Users and their email addresses are unique within a Site. User can belong to one or more Profiles and have a different role in each. User roles User has a certain role in each Profile that it is connected to. Each role gives specific access rights within an Profile. Possible roles include Owner. Each Profile may have only one Owner. Owner is responsible for the Profile. Owner has same rights as Admin. Admin. Has full access to the Profile and its Services. Is allowed to make purchases on the Profile. User. Has read-only access to the Profile. May view Services but cannot make changes to them. Profile Referenced as Profile or Customer or Customer Profile Profile, is an entity that can purchase Products in the Shop manage bought Products as Services in the Console Profile may represent a Private person or a Company. Profiles are contained within a Site and have one or more Users linked to it. Seller Profile Referenced as Seller Profile or Seller Seller Profile is an Profile with elevated privileges, which allow it to create Products on a Site. Seller Profile may put Products on sale and receive Orders for these Products. Seller Profile can: View Profiles that have bought Products which are owned by the Seller Profile View Services of the Profiles that have bought Products which are owned by the Seller Profile Seller Profile with Site administration rights Referenced as Site Administrator Seller Profiles with Site administration rights have access to additional functionality in the Manager user interface. Seller Profile that has Site admin access can make changes to the Site and manage other Seller Profile within the Site. Parts of the Site that Site admin has access include: Design Pages Settings Messaging Product Referenced as Product Products may be created by Seller Profiles. Products are contained within Site. Created Products are available for purchase in the Shop. Service Referenced as Service Services are Product instances that have been ordered. Services are contained within Site.","tags":"","url":"en\/Pilvi™_Platform\/Core_Concepts.html"},{"title":"Getting Started","text":"Create a Profile To use Pilvi Platform, you need to have a Profile on the Pilvi Platform Site you intend to use. Profile may be created by registering to the Site from the Sign up page, or by making an Order as a new Customer. Log in to Console When you have an Profile on the Pilvi Platform Site. You can login to the Platform using your email address and password. You can find the login form from the hover menu in the top right corner. You can also login via a dedicated login page. Each of the Sections have a login page available from the \/login URL path. The login pages differ only in the way the after login redirect takes the user. Shop Section login pilvi-platform-site-address\/login redirects the User to Shop front page. Console Section login pilvi-platform-site-address\/console\/login redirects the User to Console front page. Switching between sections After login, you can switch between Shop and Console Sections from the top of the left side menu. Changing Session modifiers Dependent on Site configuration. All modifiers might not be available on every Site From the bottom of the left side menu, you can: select the language to show the Site in select the currency to be used to show the prices select if the prices should have VAT included","tags":"","url":"en\/Using_Pilvi™\/Getting_Started.html"},{"title":"Making a Purchase","text":"You can purchase a Product from the Shop. The checkout process may vary between Products. Here are the main steps from the start to finish: Choose the Product from the Stop. Fill in the details needed for the Product. Login with with your existing credentials, or enter information for a new Profile. Make a payment if the Product needs one. Wait for the Service to be provisioned. The status of the ordered Services Order received. Waiting activation. The Order for the Service has been received, but the activation is still waiting in the queue or no payment has been received yet. Processing. The Service is being processed. The Service is being provisioned. Ready. The Service has been successfully provisioned and is now ready. Error. The Service provisioned failed. Please contact support to solve the issue.","tags":"","url":"en\/Using_Pilvi™\/Making_a_Purchase.html"},{"title":"Invoices","text":"An Invoice represents a balance amount that you owe to the Seller. Invoice has one or more Invoice Items that detail the amount of balance that is due for the Services. Invoices are created for every purchase that involve non-trial products. Table of Contents Paying Invoices During Checkout in the Shop On the Invoice page in Console Automatically by a background process Overdue Invoices Purchases may happen when you create a new Order through the Order channel when a previously bought Service is to be renewed for the next period When an Invoice is paid, the related Services are activated or renewed. Paying Invoices Invoices may be paid in the following ways: During Checkout in the Shop On the Invoice page in Console Automatically by a background process During Checkout in the Shop Payment methods: Credit Card, Profile Balance. If you have enough Profile Balance to cover the expenses of the Invoice in full, the Invoice is paid by consuming your Profile Balance. On the Invoice page in Console Payment methods: Credit card. Automatically by a background process Payment methods: Recurring payment via Credit Card, Profile Balance. When an Invoice is created by a background process, your Profile Balance is consumed to reduce the final sum of the Invoice if you have auto-use enabled. You can alter this behaviour per Contract or with the Profile default value. Overdue Invoices If Invoice is not paid before the due date, the payment will be made from your Profile Balance if enough balance is available. If the Profile Balance is not enough to pay the Invoice, the Recurring payment method is used if it has been enabled.","tags":"","url":"en\/Using_Pilvi™\/Invoices.html"},{"title":"Profile Settings","text":"Recurring payments To ensure that your Services will be continued, you can setup a Recurring payment method for your Customer Profile. By enabling the Recurring payments, your Invoices will be automatically paid from your Credit Card if not enough Profile Balance is available. Addresses Addresses are used to determine the country of the buyer and also as a means to speed up future checkouts by offering previously used addresses as an option.","tags":"","url":"en\/Using_Pilvi™\/Profile_Settings.html"},{"title":"Services","text":"Purchased Products will become visible on the Console, as Services. Table of Contents Service states Auto-renew Contracts Service states At any particular time, a Service is in one of the following states: State Description WAITING_ACTIVATION The Service is created, but not yet provisioned. PROCESSING The Service is being provisioned or changes are being made to it. DISPATCHED The Service was created from a One-time Purchase Product (non-recurring), and it has been successfully provisioned. No other actions will be performed for this Service. OK The Service is successfully provisioned and is now active. SUSPENDED The Service is suspended. Access is limited while in this state. Possible reason: insufficient funds, Service misuse. ERRONEOUS The Service has experienced issues and may not be fully available. EXPIRED The Service has expired, it has been suspended and it is no longer accessible. The Service can still be renewed. DISCONTINUED The Service has been discontinued. The Service cannot be renewed, and it may be terminated at any given time. Auto-renew Services that have auto-renew enabled are automatically renewed for the next period. Services that have been canceled (auto-renew disabled) will be excluded from the next periods Invoice, thus they will expire at the ends of the current period. If you cancel a Service that has already been included in an Invoice for the next period, the Invoice will be reimbursed and a new Invoice reflecting the new state of the Contract will be created at a later time. Contracts Contracts are used for grouping one or more Service into one single Invoice. Services in the same Contract are renewed at the same time, and follow the same billing interval.","tags":"","url":"en\/Using_Pilvi™\/Services.html"},{"title":"Getting Started","text":"For information on how to use Pilvi™ Platform as a Customer, see Using Pilvi™ - Getting Started To manage Pilvi Platform, you need to have access to a Seller Profile on the Pilvi Platform Site you intend to manage. To have access to a Seller Profile, you need to have your own Pilvi Platform Site set up, or you can request access some existing Site as well. Log in to Manager You can login to the Platform using your email address and password. You can find the login form from the hover menu in the top right corner. You can also login via a dedicated login page. Each of the Sections have a login page available from the \/login URL path. The login pages differ only in the way the after login redirect takes the user. Shop Section login pilvi-platform-site-address\/login redirects the User to Shop front page. Manager Section login pilvi-platform-site-address\/manager\/login redirects the User to Manager front page. Switching between sections After login, you can switch between Shop and Manager Sections from the top of the left side menu.","tags":"","url":"en\/Managing_Pilvi™\/Getting_Started.html"},{"title":"Action Rules","text":"Table of Contents Available Conditions Primary conditions Secondary conditions Available Functions Primary functions Secondary functions Action Rules are used to define and alter the behaviour of Pilvi Platform. Action Rules allow you to define Actions that will be performed when certain conditions are met. Action Rules are Site specific Rules that a Site Admin can set. Action Rules cannot alter critical system processes, such as Service life times. Example use cases for Action Rules: Sending email to Customers when some event occurs Sending a message to some 3rd party service when some event occurs Pilvi Platform provides a set of default Action Rules that give you fully working message workflow for your Customer. You can of course alter it as you see fit. Available Conditions Primary conditions Name Triggers Additional parameters LOGIN_FROM_NEW_IP Immediately USER_CREATED Immediately ORDER_CREATED Immediately SERVICE_EXPIRED Immediately SERVICE_CANCELED Immediately SERVICE_DISCONTINUED Immediately SERVICE_EXPIRES_IN Scheduled (once a day) NUMBER SERVICE_HAS_BEEN_EXPIRED_FOR Scheduled (once a day) NUMBER X_TIME_UNITS_FROM_SERVICE_CREATION Scheduled NUMBER X_TIME_UNITS_FROM_SERVICE_TRIAL_END Scheduled X_TIME_UNITS_FROM_SERVICE_TRIAL_START Scheduled NUMBER X_TIME_UNITS_TILL_SERVICE_TRIAL_END Scheduled NUMBER X_TIME_UNITS_SINCE_USERS_LAST_LOGIN_TO_PILVI_PLATFORM Scheduled NUMBER Secondary conditions May only be used with Primary conditions Name Additional options SERVICE_IS_CANCELED SERVICE_IS_NOT_CANCELED SERVICE_EXPIRES_IN_DAYS SERVICE_HAS_BEEN_EXPIRED_FOR_DAYS X_TIME_UNITS_FROM_SERVICE_CREATION_DAYS X_TIME_UNITS_FROM_SERVICE_TRIAL_START_DAYS X_TIME_UNITS_SINCE_USERS_LAST_LOGIN_TO_PILVI_PLATFORM_DAYS X_TIME_UNITS_TILL_SERVICE_TRIAL_END_DAYS RECURRING_PAYMENT_INFORMATION_IS_FILLED RECURRING_PAYMENT_INFORMATION_IS_NOT_FILLED Available Functions Primary functions Name Additional parameters SEND_ORDER_CONFIRMATION_EMAIL_TO_PROVIDER EMAIL SEND_ORDER_CONFIRMATION_EMAIL_TO_CUSTOMER SEND_EMAIL_TO_USER SEND_EMAIL_TO_PROFILE_ADMINS SEND_EMAIL_TO_SERVICES_PROFILE_ADMINS Secondary functions May only be used with Primary conditions Name Additional parameters WITH_TEMPLATE NUMBER","tags":"","url":"en\/Managing_Pilvi™\/Action_Rules.html"},{"title":"Analytics","text":"For integrating analytics tools, Pilvi™ Platform supports the following: Google Analytics Google Tag Manager Facebook Pixel To enable an analytics provider, you'll need to enable it from the Settings. In Manager Go to Settings, open Analytics tab. Enable ANALYTICS_INTEGRATIONS_XXXXX_ENABLED. Where XXXXX is the name of the provider you want to enable. Fill in additional Preferences for the integration. For ex. Google Analytics ANALYTICS_INTEGRATIONS_GOOGLE_ANALYTICS_CODE.","tags":"","url":"en\/Managing_Pilvi™\/Analytics.html"},{"title":"Branding & Themes","text":"Themes Table of Contents Themes Site Product Cards Messages Pilvi Platform provides default themes that you can configure with variables to match with your Brand. The default themes allow you to set your own logo, change colors and modify the look with some additional variables. For more detailed theme adjustments you can also alter the theme with CSS or SCSS. Site We currently provide a single default theme that you can alter to your liking with variables. Product Cards We provide 10 different themes for you to choose from, and alter your liking with variables. Messages We currently provide a single default theme that you can alter to your liking with variables.","tags":"","url":"en\/Managing_Pilvi™\/Branding_&_Themes.html"},{"title":"Catalog","text":"Table of Contents Products Provisioning method Pricing Life-time Product Cards Product Card Groups Categories Regions Brands Catalog contains sections that allow you to create and structure your Product Catalog. Products Product are orderable items that your Customers may purchase to receive a Service. Products have a localized name optional plan name as well. Plan name is often used to separate different versions of the same Product, eg. Starter, Basic, Professional. Products have a localized description field that you can edit using a WYSIWYG editor. You can create content rich pages describing your products best features, using images and\/or videos. Provisioning method Provisioning method defines how the Product is provisioned when the Order is received and activated. Manual - Email. This provisioning method sends an email to the address defined by Preference: SERVICE_PROVISIONING_DEFAULT_EMAIL_ADDRESS with the Message Template: SERVICE_EMAIL_PROVISION. Automatic - PAITA. This provisioning method uses PAITA integration to provision the Service. PAITA integration needs to be setup before. See Service Integrations. Pricing Products have 3 different pricing options: Ask for an Offer. The Product cannot be purchased. Instead, contact information is presented. One-time purchase. A single price may be set. The Service will be provisioned, but no actions will be performed by Pilvi after that. Use cases: One-time purchase to receive something in exchange. Recurring. Product has a price for a certain period. The usage of the Service may be continued after the initially paid period has ended. Product may have a setup cost, that is paid only on the first order. Product may also have a Trial period. Life-time Product may be externally managed. Externally managed Products are not visible or purchasable in the Shop can cannot have a price. Externally managed Products are used when you want your Services to be provisioned from an outside source. Product Cards Product Cards may be used to provide different views to your Products. A Product may have many Product Cards that each can have a different theme and varying fields showing information about the Product. Product Cards are components that can be embedded to external websites. Product Card Groups Product Card Groups may be used to group Product Cards from different Products into a single element. Product Card Groups enable you to show a compare view of the Products, which shows what feature is available for each Product. Product Cards Groups are components that can be embedded to external websites. Categories Categories allow you to group your Products in the Shop with any criteria you want. Categories are visible in the Side menu when in the Shop section. Regions Regions are another means of grouping your Products based on geographical location. Regions are shown separately from Categories in the Side menu. Brands Regions are another means of grouping your Products based on the provider of the Product. Brands are shown separately from Categories in the Side menu.","tags":"","url":"en\/Managing_Pilvi™\/Catalog.html"},{"title":"Content Management","text":"Pages Table of Contents Pages Variables Side menu links Simple web pages can be created by the Site admin. Page has name, i.e. slug localized title localized content. The Page slug is unique within a Site and may only contain lowercase letters a-z, numbers and dashes, since it is used in URL. The title is plain text and editable. The content of the Page is HTML and can be edited with a WYSIWYG editor. When a page has been created in Manager, it is accessible in Shop via URL \/pages\/:name e.g. \/pages\/about-this. Note that a non-active page won't be visible in the Shop. For every Shop, a predefined set of default pages are created privacy-policy terms-of-use contact These can always be reset back to the default title and content with &quot;Reset page&quot;. Reset will affect all locales of the Page. Variables Variables can be used in the Page title and content. A variable is added in double-braces, e.g. {{company.name}}. See list of available variables below: Variable Name Where the Value comes from company.name Preference: COMPANY_NAME company.email Preference: COMPANY_EMAIL company.address Preference: COMPANY_ADDRESS company.zipcode Preference: COMPANY_ZIP_CODE company.city Preference: COMPANY_CITY company.country Preference: COMPANY_COUNTRY company.phone Preference: COMPANY_PHONE company.site.url Preference: COMPANY_SITE_URL company.logo.url Preference: COMPANY_LOGO_URL company.vat.id Preference: COMPANY_VAT_ID site.name Site name. My Shop site.domain Site domain. ex. my-shop.saas.pilvi.com Side menu links Side menu links may be added for privacy-policy, terms-of-use and contact Pages. See Preferences starting with FRONTEND_SIDEMENU_LINK_.","tags":"","url":"en\/Managing_Pilvi™\/Content_Management.html"},{"title":"Customers","text":"Customers are Profiles (or Customer Profiles) which have ordered Products you have put for sale. In Manager you can see the list of all your Customers by clicking the Customers link on the side menu. From each Customer's page you can see details of its status, its Services, Invoices etc.","tags":"","url":"en\/Managing_Pilvi™\/Customers.html"},{"title":"Integrations","text":"For information on supported integrations options, see Integrations - Service Integrations and Integrations - Site Integrations","tags":"","url":"en\/Managing_Pilvi™\/Integrations.html"},{"title":"Invoices","text":"For information on how to use Invoices as a Customer, see Using Pilvi™ - Invoices","tags":"","url":"en\/Managing_Pilvi™\/Invoices.html"},{"title":"Messaging","text":"Message templates Messages templates can be defined to be used with Action Rules. Pilvi™ provides a default set of templates for you to get started with, but you can modify the templates to your liking or create new templates. Table of Contents Message templates Variables All templates Template specific User context Profile context Service context Order context Contract context Product context Variables Variable availability varies between messsage template types. Available contexts define which variables are available. Message Template Type Context USER User PROFILE User Profile SERVICES_EXPIRING User Profile SERVICE User Profile Service SERVICE_CANCELED User Profile Service SERVICE_EXPIRED_BECAUSE_UNPAID User Profile Service SERVICE_EXPIRED_BECAUSE_CANCELED User Profile Service CUSTOMER_ORDER_CONFIRMATION User Profile Order SELLER_ORDER_CONFIRMATION User Profile Order All templates Variable Name Description \/ Value source company.name Preference: COMPANY_NAME company.email Preference: COMPANY_EMAIL company.address Preference: COMPANY_ADDRESS company.zipcode Preference: COMPANY_ZIP_CODE company.city Preference: COMPANY_CITY company.country Preference: COMPANY_COUNTRY company.phone Preference: COMPANY_PHONE company.site.url Preference: COMPANY_SITE_URL company.logo.url Preference: COMPANY_LOGO_URL company.vat.id Preference: COMPANY_VAT_ID message.title Title\/Subject of the message template site.name Site name. My Shop site.console.url Site Console Root URL. ex. my-shop.saas.pilvi.com\/console site.console.account.url Site Console Account Page URL. ex. my-shop.saas.pilvi.com\/console\/account site.console.invoices.url Site Console Invoices Page URL. ex. my-shop.saas.pilvi.com\/console\/invoices site.console.services.url Site Console Services Page URL. ex. my-shop.saas.pilvi.com\/console\/services site.manager.url Site Manager URL. ex. my-shop.saas.pilvi.com\/manager year Current year Template specific Message Template Type Variable Name Description \/ Value source SERVICES_EXPIRING numberofdaysbeforeexpire Days before Service Expiration Date (prev. numberofdaysbeforeexpire) User context Variable Name Description \/ Value source user.id User Id user.email User Email user.name User Full Name user.firstname User Firstname user.lastname User Lastname Profile context Variable Name Description \/ Value source profile.name Profile Name profile.id Profile Id profile.no Profile No profile.balance Profile Balance profile.debt Profile Debt profile.address.delivery.street Profile Delivery Address Street profile.address.delivery.city Profile Delivery City profile.address.delivery.zipcode Profile Delivery Zip Code profile.address.delivery.country Profile Delivery Country profile.address.invoice.street Profile Invoice Address Street profile.address.invoice.city Prodile Invoie City profile.address.invoice.zipcode Profile Invoice Zip Code profile.address.invoice.country Profile Invoice Country profile.services List of active Services on the Profile. Contains same variables as Service context Service context Variable Name Description \/ Value source service.name Service Name service.id Service Id service.no Service No service.url Service Page URL service.expiredate Service Expiration Date service.properties[].name Service Property Name service.properties[].value Service Property Value service.product The Product of the Service. Contains same variables as Product context Order context Variable Name Description \/ Value source order.id Order ID order.no Order Number order.created Order creation time, localized order.total Order Total order.totalwithvat Order Total With VAT order.vat.rate Order VAT Rate order.vat.amount Order VAT Amount order.paymentmethod Payment method order.reference Customer reference order.additionalinfo Order additional info order.products List of Products in Order. Contains same variables as Product context Contract context Variable Name Description \/ Value source contract.id Contract ID contract.no Contract Number contract.startdate Contract start date contract.invoicedtill Contract invoiced till date contract.paidtill Contract paid till date contract.reference Contract customer referenced contract.created Contract creation time, localized Product context Variable Name Description \/ Value source Format product.name Product Name string product.plan Product Plan string product.id Product Id number product.no Product Number number product.image.url Product Image URL string product.productgroup.name Product Group Name string product.properties Product Properties [] product.properties.name Product Property Name string product.properties.value Product Property Value string product.billingperiod Product Billing Period 1 month product.billingprice Product Billing Price (price * billingperiod) 0.00 product.billingpricewithvat Product Billing VAT Price (price * billingperiod) 0.00 product.trialperiod Product Trial Period 1 month product.price Product Price (price in product price interval) 0.00 product.priceperiod Product Price Period 1 month product.pricewithvat Product VAT Price 0.00","tags":"","url":"en\/Managing_Pilvi™\/Messaging.html"},{"title":"Payments","text":"Payment options Table of Contents Payment options Stripe Invoice Currently supported payment methods: Stripe Invoice Stripe Stripe allows you to receive payments via credit cards. To enable Stripe as a payment method, you'll first need to connect a Stripe account to your Pilvi™ Site. In Manager From the side menu, under Settings, click Payment. Click Connect. After this, you will be redirected to the Stripe site and you are asked to fill information regarding your billing. At this point you may also create a new account to Stripe if you don't have one already. Go to Settings, and enable PAYMENT_METHOD_STRIPE_ENABLED You can disconnect your Stripe account from Pilvi™ at anytime. Note: after this you will not receive any more payments from Pilvi™. Invoice Invoice allows your Customers to make orders and pay them at a later date. To enable Invoice as a payment method, you'll need to enable the payment method from the Settings. In Manager Go to Settings. Enable PAYMENT_METHOD_STRIPE_ENABLED.","tags":"","url":"en\/Managing_Pilvi™\/Payments.html"},{"title":"Preferences","text":"Preferences Table of Contents Preferences List of editable Preferences General Service life time UI and Features Analytics Preferences define the configuration of your Site. By altering Preference values, you can alter the behaviour of your Site. Some Preferences provide only read-only information and are not editable by you. Preference value types are one of the following: STRING. Text value. NUMBER. Numeric value. BOOLEAN. Checkbox toggle. List of editable Preferences General Preference Name Value Type Description COMPANY_ADDRESS STRING Street address of the company. COMPANY_CITY STRING City of the company. COMPANY_COUNTRY STRING Country of the company. COMPANY_EMAIL STRING Email address for the company. COMPANY_LOGO_URL STRING URL to the logo of the company. COMPANY_NAME STRING Name of the company. COMPANY_PHONE STRING Phone number for the company. COMPANY_SITE_URL STRING Website URL of the company COMPANY_VAT_ID STRING VAT ID of the company COMPANY_ZIP_CODE STRING Zip code of the company DEFAULT_LOCALE_CODE STRING Default locale for the Site to use for root URL. Default en_US. Service life time Preference Name Value Type Description DAYS_FROM_EXPIRE_TO_DISCONTINUE NUMBER The count of days before a Service is Discontinued after being Expired. Default 30. INVOICE_SERVICE_BILLING_GROUP_DAYS_BEFORE_EXPIRE NUMBER The count of days before the Service expire time that the next Invoice is created. Default 0, Invoice is created on the expire date. SERVICE_EXPIRATION_DELAY_IN_DAYS NUMBER The offset of days for setting the Service in to EXPIRED state, after the expire time has been reached. Default 0, Service is set to EXPIRED state on the date of the expiration. UI and Features Preference Name Value Type Description FRONTEND_SIDEMENU_LINK_PRIVACY_POLICY_ENABLED BOOLEAN Show side menu link to privacy-policy Page. FRONTEND_SIDEMENU_LINK_PRIVACY_POLICY_EXTERNAL_ENABLED BOOLEAN Use external link for the side menu link of Privacy Policy. If false, internal Page is used. FRONTEND_SIDEMENU_LINK_PRIVACY_POLICY_EXTERNAL_LINK STRING URL of an external Contact page. FRONTEND_SIDEMENU_LINK_TERMS_OF_USE_ENABLED BOOLEAN Show side menu link to terms-of-use Page. FRONTEND_SIDEMENU_LINK_TERMS_OF_USE_EXTERNAL_ENABLED BOOLEAN Use external link for the side menu link of Terms of Use. If false, internal Page is used. FRONTEND_SIDEMENU_LINK_TERMS_OF_USE_EXTERNAL_LINK STRING URL of an external Terms of Use page. FRONTEND_SIDEMENU_LINK_CONTACT_ENABLED BOOLEAN Show side menu link to contact Page. FRONTEND_SIDEMENU_LINK_CONTACT_EXTERNAL_ENABLED BOOLEAN Use external link for the side menu link of Contact. If false, internal Page is used. FRONTEND_SIDEMENU_LINK_CONTACT_EXTERNAL_LINK STRING URL of an external Contact page. PAYMENT_METHOD_INVOICE_ENABLED BOOLEAN Show Invoice as a payment option PAYMENT_METHOD_STRIPE_ENABLED BOOLEAN Show Stripe as a payment option Analytics Preference Name Value Type Description ANALYTICS_INTEGRATIONS_GOOGLE_ANALYTICS_ENABLED BOOLEAN Enable Google Analytics tracking. ANALYTICS_INTEGRATIONS_GOOGLE_ANALYTICS_ID STRING Tracking code for Google Analytics. ANALYTICS_INTEGRATIONS_GOOGLE_TAG_MANAGER_ENABLED BOOLEAN Enable Google Tag Manager. ANALYTICS_INTEGRATIONS_GOOGLE_TAG_MANAGER_ID STRING TrackId for Google Tag Manager. ANALYTICS_INTEGRATIONS_FACEBOOK_PIXEL_ENABLED BOOLEAN Enable Facebook Pixel tracking. ANALYTICS_INTEGRATIONS_FACEBOOK_PIXEL_ID STRING PixelID for Facebook Pixel. ANALYTICS_INTEGRATIONS_PILVI_ENABLED BOOLEAN Enable Pilvi Analytics tracking. Planned ANALYTICS_INTEGRATIONS_PILVI_ID STRING Pilvi Tracking for Facebook Pixel. Planned","tags":"","url":"en\/Managing_Pilvi™\/Preferences.html"},{"title":"Properties","text":"Properties describe the characteristics of your Product or Customer. With Properties you can Add features to your Products, that are shown in the Shop and are comparable between Products. Add input fields to Product's configuration phase in the checkout process. Add input fields for requesting Customer information in the checkout process. Properties are also used for storing and relaying information between Pilvi and Service Integration providers. Table of Contents Property values Property validations Property categories Product Properties Customer Properties (Coming soon) Properties are case-insensitive. Property values Property has a value type, that cannot be altered after its creation: BOOLEAN. Yes\/No toggle. Shown in the UI as a checkbox. STRING. Text value. Shown in the UI as a text input field. STRING_OPTION. Text option. Shown in the UI as a selectbox. NUMBER. Numeric value. Shown in the UI as a number input field. NUMBER_RANGE. Numeric value from a certain range. Shown in the UI as a slider. Property validations Property values may also have an optional validation that restricts the value of the Property. Value Type Validation Type Validation Name STRING EMAIL Email. Spec STRING URL URL. Spec STRING DOMAIN Domain. Spec STRING HOSTNAME Hostname. Spec STRING PHONE Phone NUMBER INTEGER Integer NUMBER DECIMAL_2 Two Decimals 0.00 Property categories Properties are divided into to categories: Product and Customer. Product Properties Product Properties define a Product. Customer Properties (Coming soon)","tags":"","url":"en\/Managing_Pilvi™\/Properties.html"},{"title":"Service Integrations","text":"Service Integrations Service integrations to external service providers allow you to provision your Products to your Customers. Pilvi Automatic Integration Technology API (PAITA) PAITA aka The Pilvi Automatic Integration Technology API is an API interface designed for partners to easily sell and manage their SaaS products. For example it provides automatic provisioning, interface usage statistics, vast management options for products and services. PAITA can be also used to provide a third-party SaaS services and products for partners own Pilvi shop. PAITA is composed from two parts: Service Integration API Specification and Service Management API The Service Integration API Specification provides an interface for the partner to develop in order for Pilvi to automatically integrate into the partner’s cloud service. The Service Management API provides an interface for the partner to call in order to notify Pilvi of changes to Services. Service Management API is a supplementary API meant to be used with a Service Integration API Implementation. You can find more information and specific instructions for these API parts from links below: Service Integration API Specification Service Management API","tags":"","url":"en\/Integrations\/Service_Integrations.html"},{"title":"Site Integrations","text":"Site Integrations Site integrations allow you to integrate your Site into external services to extend with additional functionalities. Zapier Zapier integration allows any user from zapier.com receive data (by trigger each 15 minutes) about Pilvi new Services, Products and (Customer) Profiles. For authentication, the user at zapier.com selects the Pilvi app when creating Zapier Zap at zapier.com and provides Pilvi's values for: Site identifier API key API domain The values for those fields can be generated and copied at each Pilvi Site: Manager -&gt; System -&gt; Zapier Integration Currently supported Zapier Triggers for getting Pilvi data are: New Service New Product New Customer Profile","tags":"","url":"en\/Integrations\/Site_Integrations.html"},{"title":"Changelog","text":"Pilvi Platform Changelog (2018-08-08) Changes T88 Added Site specific numbering for top level objects (Services,Profile,Product,Orders,Invoices) Renamed (Account) Credits to Account Balance. Usage based billing now adds to Account Debt, which needs to be paid off using Account Balance or other payment methods Revised Service lifetime states and process. New states: WAITING_ACTIVATION, when Service is created but the Order is not yet paid EXPIRED, when Service has passed its expiration time DISPATCHED, for One-time purchase products. Services are not active after the initial activation. Revised Action Rules for all Sites to reflect the changes in Service lifetime process. New default message templates to reflect the changes in Service lifetime process Shop: Background changes for the checkout process. Services are now activated behind the scenes when the payment is received. Shop: Added an option for ordering with an Invoice. Invoice needs to be paid through the Console to activate the Services. Console: Added new top level listings for Orders, Invoices, Contracts Console Added the ability to pay Invoices using a Credit Card (Stripe). Invoices may also be paid using the Account Balance. Console: Invoice is automatically created for the next period if the Service is set to be continued Manager: Added new top level listings for Orders, Invoices, Contracts Manager: Product Pricing options Free and One-time combined to a new option called &quot;One-time Purchase&quot;. Services created from a One-time Purchase products are provisioned and not managed by Pilvi Platfrom after that. Other changes T83 Site Administrator can now enable the following analytics: Google Analytics, Google Tag Manager, Facebook Pixel. Fixes a lot of small fixes here and there (2018-05-24) Changes T281 Added Zapier integration. Triggers for new Services, Product, Customer Profiles T343 Added support for Customer defined Pages T327 Changed edit button logic and texts. Add button is now shown only in View mode. In Edit mode, the text on the Edit button is changed to 'Cancel' T287 Platform default message templates are now stored separately from other templates T357 Trailing slashes are ignored by default Fixes T355 Fixed a bug where the WYSIWYG editor failed to initialize after multiple sequential uses","tags":"","url":"en\/Changelog.html"},{"title":"Overview","text":"Pilvi™ Platform Overview page in Finnish","tags":"","url":"fi\/Overview.html"}]}